# 2 - Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# *Пример:*

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]



lis = [2, 3, 4, 5, 6]

def pr_elem(l):
    new_list = []
    for i in l:
        elem = i*l[-1]
        new_list.append(elem)
        del l[-1]  
    return new_list


print(pr_elem(lis))
